# 627. Swap Salary

### Difficulty
**Easy**

---

## Problem Statement

Given a `Salary` table, write a **single `UPDATE` statement** to swap all **'f' and 'm'** values in the `sex` column.  

- Change all `'f'` values to `'m'` and all `'m'` values to `'f'`.
- **Do not use any intermediate temporary tables**.
- **Do not write a `SELECT` statement**.

---

## Table Schema

### **Table: Salary**
| Column Name | Type    |
|-------------|---------|
| `id`        | `int`   |
| `name`      | `varchar` |
| `sex`       | `ENUM('m', 'f')` |
| `salary`    | `int`   |

- `id` is the **primary key** (unique values) for this table.
- The `sex` column has only two possible values: `'m'` (male) and `'f'` (female).
- The table contains **employee information**, including their **salary**.

---

## Example

### **Input**
#### **Salary table:**
| id  | name  | sex | salary |
|-----|-------|-----|--------|
| 1   | A     | m   | 2500   |
| 2   | B     | f   | 1500   |
| 3   | C     | m   | 5500   |
| 4   | D     | f   | 500    |

---

### **Output**
| id  | name  | sex | salary |
|-----|-------|-----|--------|
| 1   | A     | f   | 2500   |
| 2   | B     | m   | 1500   |
| 3   | C     | f   | 5500   |
| 4   | D     | m   | 500    |

---

### **Explanation**
- `(1, A)` and `(3, C)` were changed from `'m'` to `'f'`.
- `(2, B)` and `(4, D)` were changed from `'f'` to `'m'`.

---

# Solution

In [1]:
import pandas as pd

def swap_salary(salary: pd.DataFrame) -> pd.DataFrame:
    salary['sex'] = salary['sex'].replace({'m': 'f', 'f': 'm'})
    return salary

# Example Implementation

In [2]:
data = {
    "id": [1, 2, 3, 4],
    "name": ["A", "B", "C", "D"],
    "sex": ["m", "f", "m", "f"],
    "salary": [2500, 1500, 5500, 500]
}
df = pd.DataFrame(data)
df

   id name sex  salary
0   1    A   m    2500
1   2    B   f    1500
2   3    C   m    5500
3   4    D   f     500

In [3]:
swap_salary(df)

   id name sex  salary
0   1    A   f    2500
1   2    B   m    1500
2   3    C   f    5500
3   4    D   m     500

---
### **Time and Space Complexity**
| **Operation**        | **Time Complexity** | **Space Complexity** |
|----------------------|----------------|----------------|
| `.replace()` operation | **O(n)** | **O(1)** |

- **Time Complexity:** **O(n)** ‚Üí Iterates once through the column.
- **Space Complexity:** **O(1)** ‚Üí **Modifies in place** (no extra memory used).

---

# Alternative Solution 1

In [4]:
import pandas as pd

def swap_salary(salary: pd.DataFrame) -> pd.DataFrame:
    salary['sex'] = salary['sex'].map({'m': 'f', 'f': 'm'})
    return salary

# Alternative Solution 2 (slowest)

In [5]:
import pandas as pd

def swap_salary(salary: pd.DataFrame) -> pd.DataFrame:
    salary['sex'] = salary['sex'].apply(lambda x: 'f' if x == 'm' else 'm')
    return salary

---
## **Complexity Comparison**
| **Method**      | **Time Complexity** | **Space Complexity** | **Performance** |
|----------------|----------------|----------------|----------------|
| `.replace()` ‚úÖ | **O(n)** | **O(1)** | **Fastest** (Best choice) |
| `.map()` ‚úÖ | **O(n)** | **O(1)** | **Efficient** (Good alternative) |
| `.apply()` ‚ùå | **O(n)** | **O(n)** | **Slowest** (Avoid for large data) |

### **üîç Key Takeaways**
1. **Fastest Method:** ‚úÖ `.replace()` **(Recommended)**
2. **Good Alternative:** ‚úÖ `.map()`
3. **Slower:** ‚ùå `.apply()` because it **applies the function row by row**.

---